int/resources/objectRepo/xmlTemplates/opera/FrontDeskOperations/req_MassCheckInReservations.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/fof/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:MassCheckInReservationsRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria>
            <v91:HotelCode/>
            <v91:ReservationIDList>
               <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/></v91:ReservationIDList>
            <v91:AdditionalCriteria>
               <v91:RoomStatuses>
                  <v91:RoomStatus/>
               </v91:RoomStatuses>
            </v91:AdditionalCriteria>
         </v9:Criteria>
      </v9:MassCheckInReservationsRQ>
   </soapenv:Body>
</soapenv:Envelope>